/* Default message shown in error alert dialogs for validation errors when no more specific error message is available */
"A validation error occurred" = "Tapahtui validointivirhe";

/* Default message shown in error alert dialogs when no more specific error message is available */
"An error occurred" = "Tapahtui virhe";

/* Title for alert dialog button asking what to do with invalid values entered by the user */
"Discard Change" = "Hylkää muutos";

/* Default error message for formatting errors with bindings */
"Formatting Error" = "Muotoiluvirhe";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Illegal key" = "Virheellinen avain";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Key cannot be empty" = "Avain ei voi olla tyhjä";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Key is already in use" = "Avain on jo käytössä";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Value for %@ cannot be empty" = "Kohteen %@ arvo ei voi olla tyhjä";

